# SQL-5 

## Integrity  Constraints
### Handling referential integrity constraint violations
---

### Prepare the environment

In [1]:
pip install ipython-sql psycopg2

Requirement already satisfied: ipython-sql in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (0.5.0)
Requirement already satisfied: psycopg2 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (2.9.10)
Requirement already satisfied: prettytable in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: ipython in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (8.31.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (2.0.37)
Requirement already satisfied: sqlparse in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: colorama in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments>=2.4.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (0.2.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
%load_ext sql

**Note** For this activity make sure to drop and create a new `cricdb` database. Run the following command from postgres commandline.

postgres# `drop database if exists cricdb;`

postgres# `create database cricdb;`

In [3]:
%sql postgresql://postgres:070804@localhost:5432/cricdb

In [4]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [5]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [6]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [7]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [8]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [14]:
%%sql insert into player values
    (11, 'Hardik', 'Pandya', '1993-10-11', 104),
    (12, 'MS', 'Dhoni', '1981-07-07', 106),
    (23, 'Rohit', 'Sharma', '1987-04-30', 107),
    (24, 'Ruturaj', 'Gaikwad', '1997-01-31', 108);

 * postgresql://postgres:***@localhost:5432/cricdb
(psycopg2.errors.ForeignKeyViolation) insert or update on table "player" violates foreign key constraint "player_team_id_fkey"
DETAIL:  Key (team_id)=(104) is not present in table "team".

[SQL: insert into player values
    (11, 'Hardik', 'Pandya', '1993-10-11', 104),
    (12, 'MS', 'Dhoni', '1981-07-07', 106),
    (23, 'Rohit', 'Sharma', '1987-04-30', 107),
    (24, 'Ruturaj', 'Gaikwad', '1997-01-31', 108);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [10]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (102, 'Chennai Super Kings', 'India Cements Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

In [11]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102)]

**Note:** Observe the behaviour when deleting tuples from the `team` table

In [12]:
%sql delete from team where team_id = 102;

 * postgresql://postgres:***@localhost:5432/cricdb
(psycopg2.errors.ForeignKeyViolation) update or delete on table "team" violates foreign key constraint "player_team_id_fkey" on table "player"
DETAIL:  Key (team_id)=(102) is still referenced from table "player".

[SQL: delete from team where team_id = 102;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [15]:
%sql delete from team where team_id = 103;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

**Note** The above scenarios illustrate the default behaviour when having a referential integrity  constraint.

---

### No action/Set null

In [16]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [17]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [18]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [19]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id) 
    on delete set null
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [20]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [21]:
%%sql insert into player values
    (1, 'Hardik', 'Pandya', '1993-10-11', 101),
    (2, 'MS', 'Dhoni', '1981-07-07', 102),
    (3, 'Rohit', 'Sharma', '1987-04-30', 101),
    (4, 'Ruturaj', 'Gaikwad', '1997-01-31', 102);

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[]

In [22]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (102, 'Chennai Super Kings', 'India Cements Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

In [23]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102)]

In [24]:
%sql delete from team where team_id = 102;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [25]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), None),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), None)]

---
### CASCADE

In [26]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [27]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [28]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [29]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id) 
    on delete cascade
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [30]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [31]:
%%sql insert into player values
    (1, 'Hardik', 'Pandya', '1993-10-11', 101),
    (2, 'MS', 'Dhoni', '1981-07-07', 102),
    (3, 'Rohit', 'Sharma', '1987-04-30', 101),
    (4, 'Ruturaj', 'Gaikwad', '1997-01-31', 102);

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[]

In [32]:
%sql delete from team where team_id = 102;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [33]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101)]

In [34]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

**Exercise** Try cascading update or delete that cannot be handled. When can this happen? (hint: recall the `new_category` relation that we created earlier)

in recursive relationship where it is aforeign key to itself then cascade it would not work

In [47]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [48]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [49]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [50]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer DEFAULT 101,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id) 
    on update cascade
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [51]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [52]:
%%sql insert into player values
    (1, 'Hardik', 'Pandya', '1993-10-11', 101),
    (2, 'MS', 'Dhoni', '1981-07-07', 102),
    (3, 'Rohit', 'Sharma', '1987-04-30', 101),
    (4, 'Ruturaj', 'Gaikwad', '1997-01-31', 102);

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[]

In [59]:
%sql update team set team_id = 104 where team_id = 101;

 * postgresql://postgres:***@localhost:5432/cricdb
0 rows affected.

[]

In [60]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102),
 (1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 104),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 104)]

In [56]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(102, 'Chennai Super Kings', 'India Cements Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports'),
 (104, 'Mumbai Indians', 'Reliance Industry Ltd')]

---
### Set Default

In [61]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [62]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [63]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [64]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer DEFAULT 101,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id) 
    on delete set default
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [65]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [66]:
%%sql insert into player values
    (1, 'Hardik', 'Pandya', '1993-10-11', 101),
    (2, 'MS', 'Dhoni', '1981-07-07', 102),
    (3, 'Rohit', 'Sharma', '1987-04-30', 101),
    (4, 'Ruturaj', 'Gaikwad', '1997-01-31', 102);

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[]

In [67]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102)]

In [68]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (102, 'Chennai Super Kings', 'India Cements Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

In [69]:
%sql delete from team where team_id = 102;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [70]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 101)]

In [71]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

---
### Drop table

In [72]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
(psycopg2.errors.DependentObjectsStillExist) cannot drop table team because other objects depend on it
DETAIL:  constraint player_team_id_fkey on table player depends on table team
HINT:  Use DROP ... CASCADE to drop the dependent objects too.

[SQL: drop table if exists team]
(Background on this error at: https://sqlalche.me/e/20/2j85)

In [73]:
%sql drop table if exists team cascade

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [74]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 101)]

Q: What is the schema of the relation `player`?

`cricdb# \d player;`